INSERT INTO majors (
    major_name, major_code, major_code_old,
    uk_lang_coef, math_coef, history_coef, uk_literature_coef,
    foreign_lang_coef, biology_coef, geography_coef,
    physics_coef, chemistry_coef,
    competition_coef, major_coef
) VALUES
    (
    'Прикладна математика', 'f1', 113,
    0.3, 0.5, 0.2, 0.2,
    0.3, 0.2, 0.2,
    0.4, 0.3,
    0, 1
    ),
    (
        'Інженерія програмного забезпечення', 'f2', 121,
        0.3, 0.5, 0.2, 0.2,
        0.3, 0.2, 0.2,
        0.4, 0.3,
        0, 1
    ),
    (
        'Комп''ютерні науки', 'f3', 122,
        0.3, 0.5, 0.2, 0.2,
        0.3, 0.2, 0.2,
        0.4, 0.3,
        0, 1
    ),
    (
        'Системний аналіз', 'f4', 123,
        0.3, 0.5, 0.2, 0.2,
        0.3, 0.2, 0.2,
        0.4, 0.3,
        0, 1
    ),
    (
        'Кібербезпека та захист інформації', 'f5', 124,
        0.3, 0.5, 0.2, 0.2,
        0.3, 0.2, 0.2,
        0.4, 0.3,
        0, 1
    ),
    (
        'Інформаційні системи та технології', 'f6', 125,
        0.3, 0.5, 0.2, 0.2,
        0.3, 0.2, 0.2,
        0.4, 0.3,
        0, 1
    ),
    (
        'Комп''ютерна інженерія', 'f7', 126,
        0.3, 0.5, 0.2, 0.2,
        0.3, 0.2, 0.2,
        0.4, 0.3,
        0, 1
    );